#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_secretsmanager_secret.zone: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:ZONE_ID-test-5-Hn2T9E]
module.backend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-backend]
aws_secretsmanager_secret.api_email: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_EMAIL-test-5-NbIXdx]
aws_iam_policy.ecs-policy: Refreshing state... [id=arn:aws:iam::819383208824:policy/terraform-20231103010657641000000001]
module.frontend-image.aws_ecr_repository.foo: Refreshing state... [id=community-challenge-frontend]
aws_ecs_cluster.cc-cluster: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:cluster/community-challenge-cluster]
aws_iam_role.task_role: Refreshing state... [id=community-challenge-task-role]
aws_secretsmanager_secret.api_key: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:819383208824:secret:CF_API_KEY-test-5-IYtLJs]
data.aws_iam_policy_document.ecs-assume-role-role: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b56b617c41b013b7]
data.aws_iam_policy_document.ecs-assume-role-role: Read complete after 0s [id=258469924]
aws_iam_role.ecs_role: Refreshing state... [id=community-challenge-ecs-role]
aws_iam_role_policy_attachment.ecs-policy-att: Refreshing state... [id=community-challenge-ecs-role-20231103010658072000000002]
aws_iam_role_policy.task_policy: Refreshing state... [id=community-challenge-task-role:community-challenge-task_policy]
aws_ecs_task_definition.service: Refreshing state... [id=community-challenge-family]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b00a07f6575af07d]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0a090d4849550faf2]
aws_lb_target_group.test: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:targetgroup/community-challenge-tg/1e120427d3186c82]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0b319154e060ffe78]
aws_security_group.lb-sg: Refreshing state... [id=sg-0664d9808bfdc1cb3]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bbc8f233547b8837]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03b923c26afe0a2c6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a981814ac858fb76]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0afadec164048c5ea]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0afefbb8063346faa]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f66c862ca7635d5c]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ff43eb33ebab02cc]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a981814ac858fb761080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-009aec2abe4869846]
aws_security_group.ecs-sg: Refreshing state... [id=sg-0a3a16565e02df112]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06a1ef38229a8db21]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-043d1acfb60b1537a]
aws_lb.ecs-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:loadbalancer/app/community-challenge-lb/4842e4e1cf37b438]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-08e51bf33da5cdea5]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06db9a20135d6d7d1]
aws_ecs_service.cc-service: Refreshing state... [id=arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-01aee69a15d7e5926]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bbc8f233547b88371080289494]
aws_lb_listener.ec-lb-listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:819383208824:listener/app/community-challenge-lb/4842e4e1cf37b438/53839aacf0308efc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.cc-service will be updated in-place
  ~ resource "aws_ecs_service" "cc-service" {
        id                                 = "arn:aws:ecs:us-west-2:819383208824:service/community-challenge-cluster/community-challenge-service"
        name                               = "community-challenge-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:26" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.service must be replaced
-/+ resource "aws_ecs_task_definition" "service" {
      ~ arn                      = "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family:24" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:819383208824:task-definition/community-challenge-family" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "community-challenge/frontend-task/log"
                          + awslogs-region        = "us-west-2"
                          + awslogs-stream-prefix = "frontend-task"
                        }
                    }
                  - mountPoints      = []
                    name             = "nginx-frontend"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
              ~ {
                  - environment      = []
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "community-challenge/backend-task/log"
                          + awslogs-region        = "us-west-2"
                          + awslogs-stream-prefix = "backend-task"
                        }
                    }
                  - mountPoints      = []
                    name             = "proxy-backend"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (5 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "community-challenge-family" -> (known after apply)
      ~ revision                 = 24 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.log_group-be.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "community-challenge/backend-task/log"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # module.log_group-fe.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "community-challenge/frontend-task/log"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @realexcel2021, Action: `pull_request`*